// Напишите программу, которая принимает на вход два числа и проверяет, является ли одно число квадратом другого.

//   5, 25 -> да -4, 16 -> да 25, 5 -> да 8,9 -> нет


Random random = new Random ();

int firstnumber = random.Next (10,100);
int secondtnumber = random.Next (10,100);

Console.WriteLine (firstnumber);
Console.WriteLine (secondtnumber);


